"""
5)
Продолжить работу над первым заданием.
Разработать методы, отвечающие за приём оргтехники на склад и передачу в определенное подразделение компании.
Для хранения данных о наименовании и количестве единиц оргтехники,
а также других данных, можно использовать любую подходящую структуру, например словарь.
===========================================================================================
6)
Продолжить работу над вторым заданием.
Реализуйте механизм валидации вводимых пользователем данных.
Например, для указания количества принтеров, отправленных на склад,
нельзя использовать строковый тип данных.
"""
from Task_8_4 import Warehouse, Scanner, Printer, Xerox

scanner = Scanner('CanoScan LiDE 300', 'scanner', '2995C010', -100, '5600asd', '2400x2400 dpi')

printer = Printer('ECOSYS P3155dn', 'printer', '1102TR3NL0', 32, 38000, 'A4', 'laser', 55)
printer_2 = Printer('ECOSYS P4080dn', 'printer', '2385TR45NL0', 7, 4000, 'A4', 'laser', 30)

xerox = Xerox('Xerox B215', 'xerox', 'B215DNI', 45, 20000, 'A4', 'laser', 40)

receipt_list = [
    scanner,
    printer,
    printer_2,
    xerox
]

Warehouse.receipt(receipt_list)
print('=======================================================================')
for el in Warehouse.equipment_list:
    print(f'{el}')
print('=======================================================================')

print(Warehouse.equipment_info('type_equipment', 'printer'))
print('=======================================================================')

Warehouse.give_away('1102TR3NL0', 5)
print('=======================================================================')
print(Warehouse.equipment_info('type_equipment', 'printer'))
